Documents/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Продажи</Name>
			<BasedOn>
				<xr:Item>Document.Заказы</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Наличие</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаЗаказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПоставщика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураНаша</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаНаша</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазницаЦен</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварыЗаказа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкаНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаценкаПоставщика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПоставщика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПоставщиков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦенаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦенаТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтавкаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтавкаНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Продажи/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьЦенуНоменклатурыПоставщика(Номенклатура)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныПоставщиков.Номенклатура КАК Номенклатура,
	               |	ЦеныПоставщиков.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныПоставщиков КАК ЦеныПоставщиков
	               |ГДЕ
	               |	ЦеныПоставщиков.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить().Выгрузить();
	ЦенаНоменклатуры = Результат.Получить(0).Цена; 
	
	Возврат ЦенаНоменклатуры 
КонецФункции   

&НаСервере
Функция ПолучитьНоменклатуруПоставщика(Поставщик)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныПоставщиков.Поставщик КАК Поставщик,
	               |	ЦеныПоставщиков.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ЦеныПоставщиков КАК ЦеныПоставщиков
	               |ГДЕ
	               |	ЦеныПоставщиков.Поставщик = &Поставщик";
	
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	
	Результат = Запрос.Выполнить().Выгрузить();
	НоменклатураПоставщика = Результат.Получить(0).Номенклатура; 
	
	Возврат НоменклатураПоставщика
КонецФункции

&НаСервере
Функция ПолучитьЦенуНоменклатурыНашей(Номенклатура)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныТоваров.Номенклатура КАК Номенклатура,
	               |	ЦеныТоваров.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦенаТоваров КАК ЦеныТоваров
	               |ГДЕ
	               |	ЦеныТоваров.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить().Выгрузить();
	ЦенаНоменклатуры = Результат.Получить(0).Цена; 
	
	Возврат ЦенаНоменклатуры 
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПоставщикаПриИзменении(Элемент)
	// Получение цены номенклатуры поставщика
	Стр = Элементы.Товары.ТекущиеДанные;
	ЦенаПоставщика = ПолучитьЦенуНоменклатурыПоставщика(Стр.НоменклатураПоставщика);
	Стр.ЦенаПоставщика = ЦенаПоставщика;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПоставщикПриИзменении(Элемент)
	// Получение номенклатуры поставщика
	Стр = Элементы.Товары.ТекущиеДанные;
	НоменклатураПоставщика = ПолучитьНоменклатуруПоставщика(Стр.Поставщик);
	Стр.НоменклатураПоставщика = НоменклатураПоставщика;
	
	// Получение цены номенклатуры поставщика, при изменении поставщика
	ЦенаПоставщика = ПолучитьЦенуНоменклатурыПоставщика(Стр.НоменклатураПоставщика);
	Стр.ЦенаПоставщика = ЦенаПоставщика;
	Стр.РазницаЦен = Стр.ЦенаПоставщика - Стр.ЦенаНаша;
КонецПроцедуры 

&НаКлиенте
Процедура ТоварыЗаказаКоличествоПриИзменении(Элемент)
	Стр = Элементы.ТоварыЗаказа.ТекущиеДанные;
	Стр.Сумма = Стр.Количество * Стр.Цена;  
	// НДС
	Если Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС10") Тогда
		Стр.СуммаНДС = Стр.Сумма * 0.1
	ИначеЕсли Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС18") Тогда
		Стр.СуммаНДС = Стр.Сумма * 0.18
	Иначе Стр.СтавкаНДС = 0
	КонецЕсли;   
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказаЦенаПриИзменении(Элемент)
	Стр = Элементы.ТоварыЗаказа.ТекущиеДанные;
	Стр.Сумма = Стр.Количество * Стр.Цена;  
	// НДС
	Если Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС10") Тогда
		Стр.СуммаНДС = Стр.Сумма * 0.1 + Стр.Сумма
	ИначеЕсли Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС18") Тогда
		Стр.СуммаНДС = Стр.Сумма * 0.18 + Стр.Сумма
	ИначеЕсли Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС0") Тогда
		Стр.СуммаНДС = 0	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказаСтавкиНДСПриИзменении(Элемент)
	Стр = Элементы.ТоварыЗаказа.ТекущиеДанные;
	Стр.Сумма = Стр.Количество * Стр.Цена;  
	// НДС
	Если Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС10") Тогда
		Стр.СуммаНДС = Стр.Сумма * 0.1 + Стр.Сумма
	ИначеЕсли Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС18") Тогда
		Стр.СуммаНДС = Стр.Сумма * 0.18 + Стр.Сумма
	ИначеЕсли Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС0") Тогда
		Стр.СуммаНДС = 0	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказаНоменклатураПриИзменении(Элемент)
	Стр = Элементы.ТоварыЗаказа.ТекущиеДанные;
	ЦенаПоставщика = ПолучитьЦенуНоменклатурыПоставщика(Стр.Номенклатура);
	Стр.ЦенаПоставщика = ЦенаПоставщика;  
	
	Цена = ПолучитьЦенуНоменклатурыНашей(Стр.Номенклатура);
	Стр.Цена = Цена;           
	
	// Наценка поставщика формула, рассчет
	Стр.НаценкаПоставщика = (Стр.ЦенаПоставщика + Стр.Цена) / 100;
	
	Стр.Сумма = Стр.Количество * Стр.Цена;  
	
	// НДС
	Если Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС10") Тогда
		Стр.СуммаНДС = Стр.Сумма * 0.1 + Стр.Сумма
	ИначеЕсли Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС18") Тогда
		Стр.СуммаНДС = Стр.Сумма * 0.18 + Стр.Сумма
	ИначеЕсли Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС0") Тогда
		Стр.СуммаНДС = 0	
	КонецЕсли; 
КонецПроцедуры
